# ReverseIterator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupSet..::..ReverseIterator Method
GroupSet Class See Also
---
Retrieve a backward moving iterator to the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual GroupSetIterator ReverseIterator()
```

Visual Basic
---
```text
Public Overridable Function ReverseIterator As GroupSetIterator
```

Visual C++
---
```text
public:
virtual GroupSetIterator^ ReverseIterator()
```

# ### Return Value
Returns a backward moving iterator to the set.
# See Also
GroupSet Class
Autodesk.Revit.DB Namespace